import React from "react";
import styles from "./page.module.css";
import Container from "../components/layout/container/Container";

const UseAgreementPage = () => {
  return (
    <main className={styles.policy_page}>
      <Container>
        <h1 className={styles.page_title}>Пользовательское соглашение</h1>
        <p className={styles.page_desc}>
          Настоящее Пользовательское соглашение (далее "Соглашение") регулирует
          отношения между компанией Atlas Travel (далее "Компания", "Мы",
          "Наши") и пользователем (далее "Пользователь", "Вы") при использовании
          сайта и услуг, предоставляемых компанией Atlas Travel. Пользуясь
          сайтом и нашими услугами, вы соглашаетесь с условиями данного
          Соглашения.
        </p>

        <ul className={styles.main_list}>
          <li className={styles.main_list_item}>
            <h2>1. Общие положения</h2>
            <ul className={styles.main_nested_list}>
              <li>
                1.1. Настоящее Соглашение является публичной офертой в
                соответствии с законодательством, и использование вами сайта
                Atlas Travel подтверждает ваше полное согласие с его условиями.
              </li>
              <li>
                1.2. Atlas Travel оставляет за собой право вносить изменения в
                Соглашение в любое время. Обновлённая версия Соглашения
                публикуется на сайте и вступает в силу с момента её размещения.
              </li>
              <li>
                1.3. Пользователи обязуются самостоятельно отслеживать изменения
                в Соглашении. Продолжение использования сайта после публикации
                изменений считается согласием с обновленными условиями.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>2. Использование услуг</h2>
            <ul className={styles.main_nested_list}>
              <li>
                2.1. Atlas Travel предоставляет услуги по бронированию
                авиабилетов, отелей, туристических пакетов и других услуг через
                сайт.
              </li>
              <li>
                2.2. Пользователь обязуется предоставлять достоверную и
                актуальную информацию при оформлении заказов. Atlas Travel не
                несёт ответственности за ошибки в заказах, возникшие в
                результате предоставления некорректной информации.
              </li>
              <li>
                2.3. Все услуги предоставляются на условиях, указанных на сайте,
                включая их стоимость, условия бронирования и аннулирования.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>3. Обязанности пользователей</h2>
            <ul className={styles.main_nested_list}>
              <li>
                3.1. Пользователь обязуется:
                <ul className={styles.circle_list}>
                  <li>
                    Не использовать сайт и его услуги для незаконных действий;
                  </li>
                  <li>
                    Не нарушать функционирование сайта или вмешиваться в работу
                    технических средств и программного обеспечения,
                    обеспечивающего его работу;
                  </li>
                  <li>
                    Не размещать ложную, вводящую в заблуждение или
                    оскорбительную информацию на сайте.
                  </li>
                </ul>
              </li>
              <li>
                3.2. В случае нарушения данных обязательств Atlas Travel имеет
                право заблокировать доступ Пользователя к сайту и отказаться от
                предоставления услуг без предварительного уведомления.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>4. Персональные данные</h2>
            <ul className={styles.main_nested_list}>
              <li>
                4.1. Использование сайта и услуг предполагает сбор и обработку
                персональных данных Пользователя в соответствии с нашей
                Политикой конфиденциальности.
              </li>
              <li>
                4.2. Используя сайт, вы даёте согласие на обработку ваших
                персональных данных, предоставленных при регистрации или
                оформлении заказа.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>5. Ограничение ответственности</h2>
            <ul className={styles.main_nested_list}>
              <li>
                5.1. Atlas Travel предоставляет услуги в рамках действующих
                условий, указанных на сайте, но не гарантирует абсолютной
                бесперебойности работы сайта и его доступности в любое время.
              </li>
              <li>
                5.2. Мы не несем ответственности за отмену рейсов, изменение
                условий проживания в отелях или другие действия третьих сторон
                (авиакомпаний, отелей и туроператоров).
              </li>
              <li>
                5.3. Atlas Travel не несёт ответственности за убытки, понесённые
                в результате использования сайта или невозможности его
                использования, за исключением случаев, предусмотренных
                законодательством.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>6. Оплата и возврат</h2>
            <ul className={styles.main_nested_list}>
              <li>
                6.1. Оплата услуг осуществляется в соответствии с тарифами,
                указанными на сайте.
              </li>
              <li>
                6.2. Возврат средств за неиспользованные или отмененные услуги
                осуществляется в соответствии с Условиями возврата, размещёнными
                на сайте.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>7. Интеллектуальная собственность</h2>
            <ul className={styles.main_nested_list}>
              <li>
                7.1. Все текстовые, графические и иные материалы, размещённые на
                сайте, являются собственностью Atlas Travel или третьих лиц,
                передавших компании права на использование этих материалов.
              </li>
              <li>
                7.2. Пользователи не вправе использовать контент сайта без
                предварительного письменного согласия Atlas Travel. Любое
                несанкционированное копирование, использование или
                распространение материалов может повлечь за собой юридическую
                ответственность.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>8. Заключительные положения</h2>
            <ul className={styles.main_nested_list}>
              <li>
                8.1. Все споры, возникающие в связи с использованием сайта или
                услуг, регулируются в соответствии с законодательством страны, в
                которой зарегистрирована компания Atlas Travel.
              </li>
              <li>
                8.2. Если какое-либо положение данного Соглашения будет признано
                недействительным, это не повлияет на действительность остальных
                положений.
              </li>
            </ul>
          </li>
        </ul>
      </Container>
    </main>
  );
};

export default UseAgreementPage;
