import React from "react";
import styles from "./page.module.css";
import Container from "../components/layout/container/Container";

const ReturnPolicyPage = () => {
  return (
    <main className={styles.policy_page}>
      <Container>
        <h1 className={styles.page_title}>Условия возврата</h1>
        <p className={styles.page_desc}>
          Компания Atlas Travel стремится предоставить высокий уровень сервиса и
          комфорта своим клиентам. Мы понимаем, что иногда могут возникать
          непредвиденные обстоятельства, поэтому предлагаем гибкие условия
          возврата в зависимости от типа приобретенных услуг. Пожалуйста,
          ознакомьтесь с нашими правилами возврата для каждого вида продукта или
          услуги.
        </p>

        <ol className={styles.main_list}>
          <li className={styles.main_list_item}>
            <h2>1. Возврат за туристические путевки</h2>
            <p>
              Отмена туристических путевок регулируется условиями туроператоров
              и отелей-партнеров. Мы настоятельно рекомендуем внимательно
              ознакомиться с индивидуальными условиями договора при
              бронировании.
            </p>
            <ul className={styles.main_nested_list}>
              <li>
                Отмена за 30 дней до даты поездки и ранее: Полный возврат суммы
                за вычетом административного сбора (если применимо).
              </li>
              <li>Отмена за 15-29 дней: Возврат 50% от стоимости путевки.</li>
              <li>
                Отмена менее чем за 15 дней: Возврат не предусмотрен. Исключения
                возможны при предоставлении подтверждающих документов о
                форс-мажорных обстоятельствах.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>2. Возврат за авиабилеты</h2>
            <p>
              Правила возврата авиабилетов зависят от условий конкретного
              авиаперевозчика.
            </p>
            <ul className={styles.main_nested_list}>
              <li>
                Возврат по невозвратным тарифам: Такие билеты не подлежат
                возврату или обмену, за исключением случаев отмены рейсов или
                других чрезвычайных ситуаций, указанных в правилах авиакомпании.
              </li>
              <li>
                Возврат по возвратным тарифам: В случае отказа от поездки по
                возвратным тарифам сумма будет возвращена за вычетом комиссии
                авиаперевозчика и административного сбора.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>3. Возврат за отели</h2>
            <p>
              Политика возврата стоимости бронирования отелей зависит от условий
              конкретного отеля. Мы рекомендуем уточнять детали перед
              бронированием.
            </p>
            <ul className={styles.main_nested_list}>
              <li>
                Отмена за 7 дней до даты заселения и ранее: Полный возврат
                суммы.
              </li>
              <li>
                Отмена менее чем за 7 дней: Возврат зависит от политики отеля и
                может включать штрафы.
              </li>
            </ul>
          </li>
          <li className={styles.main_list_item}>
            <h2>4. Возврат за экскурсии и дополнительные услуги</h2>
            <p>
              Отмена за 48 часов и ранее: Полный возврат стоимости экскурсии или
              дополнительной услуги. Отмена менее чем за 48 часов: Возврат не
              предусмотрен.
            </p>
          </li>
          <li className={styles.main_list_item}>
            <h2>5. Процедура возврата</h2>
            <p>
              Для оформления возврата необходимо отправить запрос на нашу
              электронную почту support@atlastravel.com с указанием номера
              бронирования и причины возврата. Срок обработки запроса — до 14
              рабочих дней. Денежные средства будут возвращены на тот же метод
              оплаты, который использовался при оформлении заказа.
            </p>
          </li>
          <li className={styles.main_list_item}>
            <h2>6. Форс-мажорные обстоятельства</h2>
            <p>
              В случае форс-мажорных обстоятельств (отмена рейсов, стихийные
              бедствия, забастовки и другие непредвиденные ситуации) возврат
              может быть произведен в соответствии с условиями партнеров
              (авиакомпаний, отелей, туроператоров).
            </p>
            <p>
              Если у вас возникли вопросы относительно наших условий возврата,
              пожалуйста, свяжитесь с нашей службой поддержки по телефону +996
              700 123 456 или напишите нам на info@atlastravel.com.
            </p>
            <p>
              Atlas Travel оставляет за собой право вносить изменения в данные
              условия возврата в любое время.
            </p>
          </li>
        </ol>
      </Container>
    </main>
  );
};

export default ReturnPolicyPage;
