import React from "react";
import styles from "./page.module.css";
import BlogCard from "../components/cards/blog_cards/BlogCard";
import image_1 from "@/assets/ticket_cards/tours/image_1.jpeg";
import Container from "../components/layout/container/Container";
const Blog = () => {
  return (
    <main className={styles.blog_page}>
      <Container>
        <div className={styles.blog_list}>
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            isCardBig={true}
            title={"Туры в которых нужно побывать!"}
            desc={
              "Ах, радость от открытой дороги — это хорошее чувство. Но если вы новичок в вождении, вы можете немного нервничать, садясь за руль. Не волнуйтесь. Хотя это правда, что аварии могут случиться с каждым, есть вещи, которые вы можете сделать, чтобы водить безопасно и сделать все возможное, чтобы их избежать."
            }
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            isCardBig={true}
            title={"Туры в которых нужно побывать!"}
            desc={
              "Ах, радость от открытой дороги — это хорошее чувство. Но если вы новичок в вождении, вы можете немного нервничать, садясь за руль. Не волнуйтесь. Хотя это правда, что аварии могут случиться с каждым, есть вещи, которые вы можете сделать, чтобы водить безопасно и сделать все возможное, чтобы их избежать."
            }
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            isCardBig={true}
            title={"Туры в которых нужно побывать!"}
            desc={
              "Ах, радость от открытой дороги — это хорошее чувство. Но если вы новичок в вождении, вы можете немного нервничать, садясь за руль. Не волнуйтесь. Хотя это правда, что аварии могут случиться с каждым, есть вещи, которые вы можете сделать, чтобы водить безопасно и сделать все возможное, чтобы их избежать."
            }
          />
          <BlogCard
            src={image_1}
            alt="image 1"
            isCardBig={true}
            title={"Туры в которых нужно побывать!"}
            desc={
              "Ах, радость от открытой дороги — это хорошее чувство. Но если вы новичок в вождении, вы можете немного нервничать, садясь за руль. Не волнуйтесь. Хотя это правда, что аварии могут случиться с каждым, есть вещи, которые вы можете сделать, чтобы водить безопасно и сделать все возможное, чтобы их избежать."
            }
          />

          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />

          <BlogCard
            src={image_1}
            alt="image 1"
            title={"Туры в которых нужно побывать!"}
          />

          <BlogCard
            src={image_1}
            alt="image 1"
            isCardBig={true}
            title={"Туры в которых нужно побывать!"}
            desc={
              "Ах, радость от открытой дороги — это хорошее чувство. Но если вы новичок в вождении, вы можете немного нервничать, садясь за руль. Не волнуйтесь. Хотя это правда, что аварии могут случиться с каждым, есть вещи, которые вы можете сделать, чтобы водить безопасно и сделать все возможное, чтобы их избежать."
            }
          />
        </div>
      </Container>
    </main>
  );
};

export default Blog;
